In [1]:
import numpy as np
from pandas import Series,DataFrame
import pandas as pd

In [2]:
# サンプルデータ作成　Series 2個
ser1 = Series([0,1,2],index=['A','B','C'])
ser2 = Series([3,4,5,6],index=['A','B','C','D'])

In [3]:
ser1

A    0
B    1
C    2
dtype: int64

In [4]:
ser2

A    3
B    4
C    5
D    6
dtype: int64

In [5]:
# Seriesの加算
ser1 + ser2
# indexが両方にない場合はNaNが自動追加 計算できなかった場合

A    3.0
B    5.0
C    7.0
D    NaN
dtype: float64

In [6]:
# サンプルデータ作成 DaraFrame 2個
dframe1 = DataFrame(np.arange(4).reshape(2,2),columns=list('AB'),index=['東京都','大阪府'])
dframe1

     A  B
東京都  0  1
大阪府  2  3

In [7]:
dframe2 = DataFrame(np.arange(9).reshape(3,3),columns=list('ADC'),index=['北海道','東京都','大阪府'])
dframe2

     A  D  C
北海道  0  1  2
東京都  3  4  5
大阪府  6  7  8

In [8]:
# DataFrameの加算
dframe1 + dframe2

       A   B   C   D
北海道  NaN NaN NaN NaN
大阪府  8.0 NaN NaN NaN
東京都  3.0 NaN NaN NaN

In [9]:
# DaraFrameの加算
# addメソッドの利用でNaNではない値が指定可能
# 計算可能な場合 北海道のBは元データに存在しない
dframe1.add(dframe2,fill_value=0)

       A    B    C    D
北海道  0.0  NaN  2.0  1.0
大阪府  8.0  3.0  8.0  7.0
東京都  3.0  1.0  5.0  4.0

In [10]:
# DataFrameとSeriesの計算
# サンプルデータ作成
ser3 = dframe2.iloc[0]
ser3

A    0
D    1
C    2
Name: 北海道, dtype: int32

In [11]:
dframe2

     A  D  C
北海道  0  1  2
東京都  3  4  5
大阪府  6  7  8

In [12]:
# DataFrame-Series
# DataFrameの各行からSeriesを引く処理となる
dframe2-ser3

     A  D  C
北海道  0  0  0
東京都  3  3  3
大阪府  6  6  6